# Programming in Data Science - TP2 : Building of indicators with Pandas & Python

## 1. Loading the data

In [10]:
# Library imports
import pandas as pd

# display oprions
pd.set_option('display.max_columns', None)

In [11]:
# Recovering data
films = pd.read_csv('films.csv', sep=';', skiprows=[1], encoding='ISO-8859-1')
df_films = pd.DataFrame(films)
df_films.head()

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards,*Image
0,1990,111.0,Tie Me Up! Tie Me Down!,Comedy,"Banderas, Antonio","Abril, Victoria","Almodóvar, Pedro",68.0,No,NicholasCage.png
1,1991,113.0,High Heels,Comedy,"Bosé, Miguel","Abril, Victoria","Almodóvar, Pedro",68.0,No,NicholasCage.png
2,1983,104.0,"Dead Zone, The",Horror,"Walken, Christopher","Adams, Brooke","Cronenberg, David",79.0,No,NicholasCage.png
3,1979,122.0,Cuba,Action,"Connery, Sean","Adams, Brooke","Lester, Richard",6.0,No,seanConnery.png
4,1978,94.0,Days of Heaven,Drama,"Gere, Richard","Adams, Brooke","Malick, Terrence",14.0,No,NicholasCage.png

In [12]:
# Loading of cars df
cars = pd.read_csv('cars.csv', sep=';', skiprows=[1], encoding='ISO-8859-1')
df_cars = pd.DataFrame(cars)
df_cars.head()

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130.0,3504.0,12.0,70,US
1,Buick Skylark 320,15.0,8,350.0,165.0,3693.0,11.5,70,US
2,Plymouth Satellite,18.0,8,318.0,150.0,3436.0,11.0,70,US
3,AMC Rebel SST,16.0,8,304.0,150.0,3433.0,12.0,70,US
4,Ford Torino,17.0,8,302.0,140.0,3449.0,10.5,70,US

## 2. Data preprocessing

### 2.1. Films

In [13]:
df_films.describe(include='all')

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards,*Image
count,1659.000000,1592.000000,1659,1657,1651,1281,1406,1653.000000,1659,1659
unique,NaN,NaN,1657,15,759,710,755,NaN,2,27
top,NaN,NaN,White Lightning,Drama,"Wayne, John","Bergman, Ingrid","Hitchcock, Alfred",NaN,No,NicholasCage.png
freq,NaN,NaN,2,655,81,27,34,NaN,1496,1151
mean,1975.802893,105.179648,NaN,NaN,NaN,NaN,NaN,43.110103,NaN,NaN
std,17.057848,30.629501,NaN,NaN,NaN,NaN,NaN,26.747406,NaN,NaN
min,1920.000000,5.000000,NaN,NaN,NaN,NaN,NaN,0.000000,NaN,NaN
25%,1967.000000,90.000000,NaN,NaN,NaN,NaN,NaN,19.000000,NaN,NaN
50%,1983.000000,102.000000,NaN,NaN,NaN,NaN,NaN,43.000000,NaN,NaN
75%,1989.000000,116.000000,NaN,NaN,NaN,NaN,NaN,67.000000,NaN,NaN
max,1997.000000,450.000000,NaN,NaN,NaN,NaN,NaN,88.000000,NaN,NaN

In [14]:
df_films.dtypes

Year            int64
Length        float64
Title          object
Subject        object
Actor          object
Actress        object
Director       object
Popularity    float64
Awards         object
*Image         object
dtype: object

In [15]:
df_films['ImageFile'] = df_films['*Image'].astype(str).str.replace('*', '', regex=False)
df_films = df_films.drop(columns=['*Image'])
colonnes_str = ['Title', 'Subject', 'Actor', 'Actress', 'Director', 'Awards', 'ImageFile']

for col in colonnes_str:
    df_films[col] = df_films[col].astype(str).str.strip()
df_films = df_films.dropna(subset=['Year', 'Length'])

df_films.head()

,Year,Length,Title,Subject,Actor,Actress,Director,Popularity,Awards,ImageFile
0,1990,111.0,Tie Me Up! Tie Me Down!,Comedy,"Banderas, Antonio","Abril, Victoria","Almodóvar, Pedro",68.0,No,NicholasCage.png
1,1991,113.0,High Heels,Comedy,"Bosé, Miguel","Abril, Victoria","Almodóvar, Pedro",68.0,No,NicholasCage.png
2,1983,104.0,"Dead Zone, The",Horror,"Walken, Christopher","Adams, Brooke","Cronenberg, David",79.0,No,NicholasCage.png
3,1979,122.0,Cuba,Action,"Connery, Sean","Adams, Brooke","Lester, Richard",6.0,No,seanConnery.png
4,1978,94.0,Days of Heaven,Drama,"Gere, Richard","Adams, Brooke","Malick, Terrence",14.0,No,NicholasCage.png

In [16]:
print(f"Duplicate : {df_films.duplicated().sum()}")
print(df_films.isnull().sum())

Duplicate : 0
Year          0
Length        0
Title         0
Subject       0
Actor         0
Actress       0
Director      0
Popularity    6
Awards        0
ImageFile     0
dtype: int64

### 2.2. Cars

In [17]:
df_cars.describe(include='all')

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
count,406,406.000000,406.000000,406.000000,406.000000,406.000000,406.000000,406.000000,406
unique,308,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3
top,Toyota Corolla,NaN,NaN,NaN,NaN,NaN,NaN,NaN,US
freq,9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,254
mean,NaN,23.051232,5.475369,194.779557,103.529557,2979.413793,15.519704,75.921182,NaN
std,NaN,8.401777,1.712160,104.922458,40.520659,847.004328,2.803359,3.748737,NaN
min,NaN,0.000000,3.000000,68.000000,0.000000,1613.000000,8.000000,70.000000,NaN
25%,NaN,17.000000,4.000000,105.000000,75.000000,2226.500000,13.700000,73.000000,NaN
50%,NaN,22.350000,4.000000,151.000000,93.500000,2822.500000,15.500000,76.000000,NaN
75%,NaN,29.000000,8.000000,302.000000,129.000000,3618.250000,17.175000,79.000000,NaN
max,NaN,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000,NaN

In [18]:
df_cars.dtypes

Car              object
MPG             float64
Cylinders         int64
Displacement    float64
Horsepower      float64
Weight          float64
Acceleration    float64
Model             int64
Origin           object
dtype: object

In [20]:
print(f"Duplicate : {df_cars.duplicated().sum()}")
print(df_cars.isnull().sum())
df_cars = df_cars.dropna(subset=['MPG', 'Horsepower'])
df_cars.head()

Duplicate : 0
Car             0
MPG             0
Cylinders       0
Displacement    0
Horsepower      0
Weight          0
Acceleration    0
Model           0
Origin          0
dtype: int64

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
0,Chevrolet Chevelle Malibu,18.0,8,307.0,130.0,3504.0,12.0,70,US
1,Buick Skylark 320,15.0,8,350.0,165.0,3693.0,11.5,70,US
2,Plymouth Satellite,18.0,8,318.0,150.0,3436.0,11.0,70,US
3,AMC Rebel SST,16.0,8,304.0,150.0,3433.0,12.0,70,US
4,Ford Torino,17.0,8,302.0,140.0,3449.0,10.5,70,US

## 3. Key Indicators for the cars data set

### 3.1 Mean power by number of cylinder

In [21]:
hp_par_cylindre = df_cars.groupby('Cylinders')['Horsepower'].mean().sort_index()

print(hp_par_cylindre)

Cylinders
3     99.250000
4     76.574879
5     82.333333
6    100.297619
8    158.453704
Name: Horsepower, dtype: float64

### 3.2 Average consumption by origine

In [22]:
mpg_par_origine = df_cars.groupby('Origin')['MPG'].mean().sort_values(ascending=False)

print(mpg_par_origine)

Origin
Japan     30.450633
Europe    26.745205
US        19.688189
Name: MPG, dtype: float64

### 3.3 Top 5 heaviest cars

In [23]:
df_cars.sort_values(by='Weight', ascending=False).head(5)

,Car,MPG,Cylinders,Displacement,Horsepower,Weight,Acceleration,Model,Origin
51,Pontiac Safari (sw),13.0,8,400.0,175.0,5140.0,12.0,71,US
110,Chevrolet Impala,11.0,8,400.0,150.0,4997.0,14.0,73,US
49,Dodge Monaco (sw),12.0,8,383.0,180.0,4955.0,11.5,71,US
97,Mercury Marquis Brougham,12.0,8,429.0,198.0,4952.0,11.5,73,US
102,Buick Electra 225 Custom,12.0,8,455.0,225.0,4951.0,11.0,73,US

## 4. Indicator for the films Data Set

### 4.1 Number of nominated films by subject

In [24]:
films_primes = df_films[df_films['Awards'].str.lower() == 'yes']
films_primes['Subject'].value_counts()

Subject
Drama              109
Comedy              31
Music                4
Western              4
Science Fiction      4
Horror               2
Mystery              2
War                  2
Adventure            1
Name: count, dtype: int64

### 4.2 Best Director (by popularity)

In [25]:
df_films.groupby('Director')['Popularity'].mean().sort_values(ascending=False).head(10)

Director
Spottiswoode, Roger    88.0
Prior, David A.        88.0
Pytka, Joe             88.0
Houck, Joy, Jr.        88.0
Jaglom, Henry          88.0
Imamura, Shohei        88.0
Pal, George            88.0
Winkler, Irwin         88.0
Finkleman, Ken         88.0
Beebe, Ford            87.0
Name: Popularity, dtype: float64

### 4.3 Number of films by decades

In [26]:
df_films['Decade'] = (df_films['Year'] // 10) * 10
df_films['Decade'].value_counts().sort_index()

Decade
1920     23
1930     67
1940     89
1950    124
1960    150
1970    241
1980    586
1990    312
Name: count, dtype: int64

## 5. Indicator for *Northwind* DataFrame

In [27]:
orders = pd.read_csv('NorthwindDB/orders.csv', on_bad_lines='skip')
customers = pd.read_csv('NorthwindDB/customers.csv', on_bad_lines='skip')
order_details = pd.read_csv('NorthwindDB/order-details.csv')
products = pd.read_csv('NorthwindDB/products.csv')
categories = pd.read_csv('NorthwindDB/categories.csv')
employees = pd.read_csv('NorthwindDB/employees.csv')

### 5.1 Number of orders by country

In [28]:
cmd_cli = orders.merge(customers, on='customerID')
cmd_cli.groupby('country')['orderID'].nunique().sort_values(ascending=False).head(10)

country
Germany      122
USA          122
UK            56
Venezuela     46
Austria       40
Sweden        37
Canada        30
Italy         28
Mexico        28
Finland       22
Name: orderID, dtype: int64

### 5.2 Local sales sorted by categories

In [31]:
od_prod = order_details.merge(products, on='productID', suffixes=('_order', '_product'))
od_prod_cat = od_prod.merge(categories, on='categoryID')

od_prod_cat['ventes'] = od_prod_cat['quantity'] * od_prod_cat['unitPrice_order']

sales_by_cat = (
    od_prod_cat.groupby('categoryName')['ventes']
    .sum()
    .sort_values(ascending=False)
)

print("Total Sales by Categories :")
print(sales_by_cat)

Total Sales by Categories :
categoryName
Beverages         286526.95
Dairy Products    251330.50
Meat/Poultry      178188.80
Confections       177099.10
Seafood           141623.09
Condiments        113694.75
Produce           105268.60
Grains/Cereals    100726.80
Name: ventes, dtype: float64

### 5.3 Top 5 employees

In [23]:
cmd_det = orders.merge(order_details, on='orderID')
cmd_det['ventes'] = cmd_det['quantity'] * cmd_det['unitPrice']
ventes_emp = cmd_det.merge(employees, on='employeeID')
ventes_emp.groupby(['employeeID','lastName','firstName'])['ventes'].sum().sort_values(ascending=False).head(5)

employeeID  lastName   firstName
4           Peacock    Margaret     188830.43
3           Leverling  Janet        185833.80
1           Davolio    Nancy        157460.41
2           Fuller     Andrew       157279.15
7           King       Robert       126457.99
Name: ventes, dtype: float64